Revit 2027 API
PanelScheduleData.IsFooterSectionHidden Property
 True if the user wishes to hide the footer section; setting this value must go through the appropriate update function
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFooterSectionHidden { get; }
Public ReadOnly Property IsFooterSectionHidden As Boolean
	Get
public:
property bool IsFooterSectionHidden {
	bool get ();
}
member IsFooterSectionHidden : bool with get
Property Value
Boolean
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace